STMicroelectronics/STM32CubeG4/Middlewares/ST/STM32_USBPD_Library/Core/src/usbpd_dpm_core.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    usbpd_dpm_core.c
  * @author  MCD Application Team
  * @brief   USBPD dpm core file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

#define __USBPD_DPM_CORE_C

/* Includes ------------------------------------------------------------------*/
#include "usbpd_core.h"
#if defined(USBPD_TCPM_MODULE_ENABLED)
#if defined(USBPD_STUSB1605)
#include "p-nucleo-usb002.h"
#else
#include "usbpd_tcpci.h"
#endif /*USBPD_STUSB1605*/
#endif /* USBPD_TCPM_MODULE_ENABLED */
#include "usbpd_trace.h"
#include "usbpd_dpm_core.h"
#include "usbpd_dpm_user.h"
#include "usbpd_dpm_conf.h"
#ifdef _RTOS
#include "cmsis_os.h"
#if (osCMSIS >= 0x20000U)
#include "task.h"
#endif /* osCMSIS >= 0x20000U */
#else
#if defined(USBPD_TCPM_MODULE_ENABLED)
#include "usbpd_timersserver.h"
#endif /* USBPD_TCPM_MODULE_ENABLED */
#endif /* _RTOS */
#if defined(_FWUPDATE_RESPONDER)
#include "usbpd_pdfu_responder.h"
#endif /* _FWUPDATE_RESPONDER */

#if defined(_LOW_POWER)
#include "usbpd_lowpower.h"
#endif

/* Private enum */
enum
{
  USBPD_THREAD_PORT_0 = USBPD_PORT_0,
#if USBPD_PORT_COUNT == 2
  USBPD_THREAD_PORT_1 = USBPD_PORT_1,
#endif
  USBPD_THREAD_CAD
};

/* Generic STM32 prototypes */
extern uint32_t HAL_GetTick(void);

/* Private function prototypes -----------------------------------------------*/
#if (osCMSIS < 0x20000U)

void USBPD_PE_Task(void const *argument);
#if defined(USBPD_TCPM_MODULE_ENABLED)
void USBPD_ALERT_Task(void const *argument);
#else
void USBPD_CAD_Task(void const *argument);
#endif /* USBPD_TCPM_MODULE_ENABLED */
#if defined(_TRACE) || defined(_GUI_INTERFACE)
void USBPD_TRACE_TX_Task(void const *argument);
#endif /* _TRACE || _GUI_INTERFACE */

#else /* osCMSIS >= 0x20000U */

void USBPD_PE_Task_P0(void *argument);
void USBPD_PE_Task_P1(void *argument);
static void PE_Task(uint32_t PortNum);
#if defined(USBPD_TCPM_MODULE_ENABLED)
void USBPD_ALERT_Task(void *argument);
#else
void USBPD_CAD_Task(void *argument);
#endif /* USBPD_TCPM_MODULE_ENABLED */
#if defined(_TRACE) || defined(_GUI_INTERFACE)
void USBPD_TRACE_TX_Task(void *argument);
#endif /* _TRACE || _GUI_INTERFACE */

#endif /* osCMSIS < 0x20000U */

/* Private typedef -----------------------------------------------------------*/
#ifdef _RTOS
#if (osCMSIS < 0x20000U)
#define DPM_STACK_SIZE_ADDON_FOR_CMSIS              1
#else
#define DPM_STACK_SIZE_ADDON_FOR_CMSIS              3
#endif /* osCMSIS < 0x20000U */
#define FREERTOS_PE_PRIORITY                    osPriorityAboveNormal
#if defined(_VDM)
#define FREERTOS_PE_STACK_SIZE                  (350 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#elif defined(__AUTHENTICATION__)
#define FREERTOS_PE_STACK_SIZE                  (350 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#else
#define FREERTOS_PE_STACK_SIZE                  (200 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#endif /*_VDM*/
#if defined(USBPD_TCPM_MODULE_ENABLED)
#define FREERTOS_ALERT_PRIORITY                 osPriorityRealtime
#if defined(_TRACE)
#define FREERTOS_ALERT_STACK_SIZE               (240 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#else
#define FREERTOS_ALERT_STACK_SIZE               (120 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#endif /* _TRACE */
#else
#define FREERTOS_CAD_PRIORITY                   osPriorityRealtime
#define FREERTOS_CAD_STACK_SIZE                 (300 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#endif /*USBPD_TCPM_MODULE_ENABLED*/
#if defined(_TRACE) || defined(_GUI_INTERFACE)
#define FREERTOS_TRACE_PRIORITY                 osPriorityLow
#define FREERTOS_TRACE_STACK_SIZE               (300 * DPM_STACK_SIZE_ADDON_FOR_CMSIS)
#endif /* _TRACE || _GUI_INTERFACE */

#if (osCMSIS < 0x20000U)
osThreadDef(PE_0, USBPD_PE_Task, FREERTOS_PE_PRIORITY, 0, FREERTOS_PE_STACK_SIZE);
osThreadDef(PE_1, USBPD_PE_Task, FREERTOS_PE_PRIORITY, 0, FREERTOS_PE_STACK_SIZE);
osMessageQDef(queuePE, 1, uint16_t);
#if defined(USBPD_TCPM_MODULE_ENABLED)
osThreadDef(ALERTTask, USBPD_ALERT_Task, FREERTOS_ALERT_PRIORITY, 0, FREERTOS_ALERT_STACK_SIZE);
#else
osThreadDef(CAD, USBPD_CAD_Task, FREERTOS_CAD_PRIORITY, 0, FREERTOS_CAD_STACK_SIZE);
osMessageQDef(queueCAD, 2, uint16_t);
#endif /* USBPD_TCPM_MODULE_ENABLED */
#if defined(_TRACE) || defined(_GUI_INTERFACE)
osThreadDef(TRA_TX, USBPD_TRACE_TX_Task, FREERTOS_TRACE_PRIORITY, 0, FREERTOS_TRACE_STACK_SIZE);
osMessageQDef(queueTRACE, 1, uint16_t);
#endif /* _TRACE || _GUI_INTERFACE */

#else /* osCMSIS >= 0x20000U */

osThreadAttr_t PE0_Thread_Atrr = {
  .name       = "PE_0",
  .priority   = FREERTOS_PE_PRIORITY, /*osPriorityAboveNormal,*/
  .stack_size = FREERTOS_PE_STACK_SIZE
};
osThreadAttr_t PE1_Thread_Atrr = {
  .name       = "PE_1",
  .priority   = FREERTOS_PE_PRIORITY,
  .stack_size = FREERTOS_PE_STACK_SIZE
};

#if defined(USBPD_TCPM_MODULE_ENABLED)
osThreadAttr_t ALERT_Thread_Atrr = {
  .name       = "ALERTTask",
  .priority   = FREERTOS_ALERT_PRIORITY, /*osPriorityRealtime,*/
  .stack_size = FREERTOS_ALERT_STACK_SIZE
};
#else
osThreadAttr_t CAD_Thread_Atrr = {
  .name       = "CAD",
  .priority   = FREERTOS_CAD_PRIORITY, /*osPriorityRealtime,*/
  .stack_size = FREERTOS_CAD_STACK_SIZE
};
#endif /* USBPD_TCPM_MODULE_ENABLED */

#if defined(_TRACE) || defined(_GUI_INTERFACE)
osThreadAttr_t TRA_Thread_Atrr = {
  .name       = "TRA_TX",
  .priority   = FREERTOS_TRACE_PRIORITY, /*osPriorityLow,*/
  .stack_size = FREERTOS_TRACE_STACK_SIZE
};
#endif /* _TRACE || _GUI_INTERFACE */
#endif /* osCMSIS < 0x20000U */
#endif /* _RTOS */

