STMicroelectronics/STM32CubeG4/Middlewares/ST/STM32_USBPD_Library/Core/src/usbpd_dpm_core.c
#endif /* _RTOS */
#if defined(USBPD_TCPM_MODULE_ENABLED)
  USBPD_TCPI_AlertInit();
#endif /* USBPD_TCPM_MODULE_ENABLED */

  return USBPD_OK;
}

/**
  * @brief  Initialize the OS parts (port power role, PWR_IF, CAD and PE Init procedures)
  * @retval None
  */
void USBPD_DPM_Run(void)
{
#ifdef _RTOS
#if (osCMSIS >= 0x20000U)
  osKernelInitialize();
#endif /* osCMSIS >= 0x20000U */
  osKernelStart();
#else
  do
  {
#if defined(USBPD_TCPM_MODULE_ENABLED)
#else /* !USBPD_TCPM_MODULE_ENABLED */
    (void)USBPD_CAD_Process();
#endif /* USBPD_TCPM_MODULE_ENABLED */

#if !defined(USBPDCORE_LIB_NO_PD)
    if ((HAL_GetTick() - DPM_Sleep_start[USBPD_PORT_0]) >=  DPM_Sleep_time[USBPD_PORT_0])
    {
      DPM_Sleep_time[USBPD_PORT_0] =
#ifdef _DRP
        USBPD_PE_StateMachine_DRP(USBPD_PORT_0);
#elif _SRC
        USBPD_PE_StateMachine_SRC(USBPD_PORT_0);
#elif _SNK
        USBPD_PE_StateMachine_SNK(USBPD_PORT_0);
#endif /* _DRP */
      DPM_Sleep_start[USBPD_PORT_0] = HAL_GetTick();
    }

#if USBPD_PORT_COUNT == 2
    if ((HAL_GetTick() - DPM_Sleep_start[USBPD_PORT_1]) >=  DPM_Sleep_time[USBPD_PORT_1])
    {
      DPM_Sleep_time[USBPD_PORT_1] =
#ifdef _DRP
        USBPD_PE_StateMachine_DRP(USBPD_PORT_1);
#elif _SRC
        USBPD_PE_StateMachine_SRC(USBPD_PORT_1);
#elif _SNK
        USBPD_PE_StateMachine_SNK(USBPD_PORT_1);
#endif /* _DRP */
      DPM_Sleep_start[USBPD_PORT_1] = HAL_GetTick();
    }
#endif /* USBPD_PORT_COUNT == 2 */
#endif /* USBPDCORE_LIB_NO_PD */

    USBPD_DPM_UserExecute(NULL);
#if defined(_TRACE) || defined(_GUI_INTERFACE)
    (void)USBPD_TRACE_TX_Process();
#endif /* _TRACE || _GUI_INTERFACE */

#if defined(_SIMULATOR)
    return;
#endif
  }
  while (1u == 1u);
#endif /* _RTOS */
}


#if !defined(USBPDCORE_LIB_NO_PD)
/**
  * @brief  Initialize DPM (port power role, PWR_IF, CAD and PE Init procedures)
  * @retval USBPD status
  */
void USBPD_DPM_TimerCounter(void)
{
  /* Call PE/PRL timers functions only if DPM is initialized */
  if (USBPD_TRUE == DPM_Params[USBPD_PORT_0].DPM_Initialized)
  {
    USBPD_DPM_UserTimerCounter(USBPD_PORT_0);
    USBPD_PE_TimerCounter(USBPD_PORT_0);
    USBPD_PRL_TimerCounter(USBPD_PORT_0);
#if defined(_FWUPDATE_RESPONDER)
    USBPD_PDFU_TimerCounter(USBPD_PORT_0);
#endif /* _FWUPDATE_RESPONDER */
  }
#if USBPD_PORT_COUNT==2
  if (USBPD_TRUE == DPM_Params[USBPD_PORT_1].DPM_Initialized)
  {
    USBPD_DPM_UserTimerCounter(USBPD_PORT_1);
    USBPD_PE_TimerCounter(USBPD_PORT_1);
    USBPD_PRL_TimerCounter(USBPD_PORT_1);
#if defined(_FWUPDATE_RESPONDER)
    USBPD_PDFU_TimerCounter(USBPD_PORT_1);
#endif /* _FWUPDATE_RESPONDER */
  }
#endif /* USBPD_PORT_COUNT == 2 */

#ifdef _RTOS
#if (osCMSIS >= 0x20000U)
  /* SysTick Handler now fully handled on CMSIS OS V2 side */
#else
  /* check to avoid count before OSKernel Start */
  if (uxTaskGetNumberOfTasks() != 0)
  {
    osSystickHandler();
  }
#endif /* osCMSIS >= 0x20000U */
#endif /* _RTOS */
}

/**
  * @brief  WakeUp PE task
  * @param  PortNum port number
  * @retval None
  */
static void USBPD_PE_TaskWakeUp(uint8_t PortNum)
{
#ifdef _RTOS
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(PEQueueId[PortNum], 0xFFFF, 0);
#else
  uint32_t event = 0xFFFFU;
  (void)osMessageQueuePut(PEQueueId[PortNum], &event, 0U, 0U);
#endif /* osCMSIS < 0x20000U */
#else
  DPM_Sleep_time[PortNum] = 0;
  DPM_Sleep_start[PortNum] = HAL_GetTick();
#endif /* _RTOS */
}
#endif /* USBPDCORE_LIB_NO_PD */

/**
  * @brief  WakeUp CAD task
  * @retval None
  */
#if !defined(USBPDCORE_LIB_NO_PD)||defined(USBPD_TYPE_STATE_MACHINE)
static void USBPD_DPM_CADTaskWakeUp(void)
{
#ifdef _RTOS
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(CADQueueId, 0xFFFF, 0);
#else
  uint32_t event = 0xFFFFU;
  (void)osMessageQueuePut(CADQueueId, &event, 0U, 0U);
#endif /* osCMSIS < 0x20000U */
#endif /* _RTOS */
}
#endif /* !USBPDCORE_LIB_NO_PD||USBPD_TYPE_STATE_MACHINE */

#ifdef _RTOS
#if (osCMSIS < 0x20000U)
/**
  * @brief  Main task for PE layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_PE_Task(void const *argument)
{
  uint8_t _port = (uint32_t)argument;

#ifdef _LOW_POWER
  LPM_SetOffMode((LPM_Id_t)(LPM_PE_0 + _port), LPM_Disable);
#endif

  for (;;)
  {
    osMessageGet(PEQueueId[_port],
#if defined(_DRP)
    USBPD_PE_StateMachine_DRP(_port));
#elif defined(_SRC)
    USBPD_PE_StateMachine_SRC(_port));
#elif defined(_SNK)
    USBPD_PE_StateMachine_SNK(_port));
#endif
  }
}

#else /* osCMSIS > 0x20000U */

/**
  * @brief  Main task for PE layer on Port0
  * @param  argument Not used
  * @retval None
  */
void USBPD_PE_Task_P0(void *argument)
{
  PE_Task(USBPD_PORT_0);
}

/**
  * @brief  Main task for PE layer on Port1
  * @param  argument Not used
  * @retval None
  */
void USBPD_PE_Task_P1(void *argument)
{
  PE_Task(USBPD_PORT_1);
}

/**
  * @brief  Main task for PE layer
  * @param  argument Not used
  * @retval None
  */
static void PE_Task(uint32_t PortNum)
{
#ifdef _LOW_POWER
  LPM_SetOffMode((LPM_Id_t)(LPM_PE_0 + PortNum), LPM_Disable);
#endif

  for (;;)
  {
    uint32_t event;
    (void)osMessageQueueGet(PEQueueId[PortNum], &event, NULL,
#if defined(_DRP)
    USBPD_PE_StateMachine_DRP(PortNum));
#elif defined(_SRC)
    USBPD_PE_StateMachine_SRC(PortNum));
#elif defined(_SNK)
    USBPD_PE_StateMachine_SNK(PortNum));
#endif
  }
}
#endif /* osCMSIS < 0x20000U */

#if defined(USBPD_TCPM_MODULE_ENABLED)
/**
  * @brief  Main task for ALERT layer
  * @param  argument: Not used
  * @retval None
  */
#if (osCMSIS < 0x20000U)
void USBPD_ALERT_Task(void const *queue_id)
#else
void USBPD_ALERT_Task(void *queue_id)
#endif /* osCMSIS < 0x20000U */
{
  osMessageQId  queue = *(osMessageQId *)queue_id;
  uint8_t port;
  for (;;)
  {
#if (osCMSIS < 0x20000U)
    osEvent event = osMessageGet(queue, osWaitForever);
    port = (event.value.v >> 8);
#else
    (void)osMessageQueueGet(queue, &event, NULL, osWaitForever);
    port = (event >> 8);
#endif /* osCMSIS < 0x20000U */
#if defined(_TRACE)
    USBPD_TRACE_Add(USBPD_TRACE_DEBUG, port, ((event.value.v) & 0x00FF), "ALERT_TASK", sizeof("ALERT_TASK") - 1);
#endif /* _TRACE */
#if (osCMSIS < 0x20000U)
    USBPD_TCPM_alert(event.value.v);
#else
    USBPD_TCPM_alert(event);
#endif /* osCMSIS < 0x20000U */
    HAL_NVIC_EnableIRQ(ALERT_GPIO_IRQHANDLER(port));
  }
}
#else /* !USBPD_TCPM_MODULE_ENABLED */
/**
  * @brief  Main task for CAD layer
  * @param  argument Not used
  * @retval None
  */
#if (osCMSIS < 0x20000U)
void USBPD_CAD_Task(void const *argument)
#else
void USBPD_CAD_Task(void *argument)
#endif /* osCMSIS < 0x20000U */
{
#ifdef _LOW_POWER
  LPM_SetOffMode(LPM_CAD,LPM_Disable);
#endif
  for (;;)
  {
#if (osCMSIS < 0x20000U)
    osMessageGet(CADQueueId, USBPD_CAD_Process());
#else
    uint32_t event;
    (void)osMessageQueueGet(CADQueueId, &event, NULL, USBPD_CAD_Process());
#endif /* osCMSIS < 0x20000U */
  }
}
#endif /* USBPD_TCPM_MODULE_ENABLED */

#if defined(_TRACE) || defined(_GUI_INTERFACE)
/**
  * @brief  Main task for TRACE TX layer
  * @param  argument Not used
  * @retval None
  */
#if (osCMSIS < 0x20000U)
void USBPD_TRACE_TX_Task(void const *argument)
#else
void USBPD_TRACE_TX_Task(void *argument)
#endif /* osCMSIS < 0x20000U */
{
  for (;;)
  {
#if (osCMSIS < 0x20000U)
    osMessageGet(TraceQueueId,USBPD_TRACE_TX_Process());
#else
    uint32_t event;
    (void)osMessageQueueGet(TraceQueueId, &event, NULL, USBPD_TRACE_TX_Process());
#endif /* osCMSIS < 0x20000U */
  }
}
#endif /* _TRACE || _GUI_INTERFACE */
#endif /* _RTOS */

#if defined(_TRACE)
/**
  * @brief  WakeUp TRACE task
  * @retval None
  */
void USBPD_DPM_TraceWakeUp(void)
{
#ifdef _RTOS
  if (NULL != TraceQueueId)
  {
#if (osCMSIS < 0x20000U)
    (void)osMessagePut(TraceQueueId, 0xFFFF, 0);
#else
    uint32_t event = 0xFFFFU;
    (void)osMessageQueuePut(TraceQueueId, &event, 0U, 0U);
#endif /* osCMSIS < 0x20000U */
  }
#else
  /* Wake up the non RTOS application to evacuate the trace */
#endif /* _RTOS */
}
#endif /* _TRACE */

/**
  * @brief  CallBack reporting events on a specified port from CAD layer.
  * @param  PortNum   The handle of the port
  * @param  State     CAD state
  * @param  Cc        The Communication Channel for the USBPD communication
  * @retval None
  */
#if defined(USBPDCORE_LIB_NO_PD)
void USBPD_DPM_CADCallback(uint8_t PortNum, USBPD_CAD_EVENT State, CCxPin_TypeDef Cc)
{
#ifdef _TRACE
  USBPD_TRACE_Add(USBPD_TRACE_CADEVENT, PortNum, (uint8_t)State, NULL, 0);
#endif /* _TRACE */

  switch (State)
  {
  case USBPD_CAD_EVENT_ATTEMC :
  case USBPD_CAD_EVENT_ATTACHED :
    {
      DPM_Params[PortNum].ActiveCCIs = Cc;
      USBPD_DPM_UserCableDetection(PortNum, State);
      break;
    }
  case USBPD_CAD_EVENT_DETACHED :
  case USBPD_CAD_EVENT_EMC :
    {
      USBPD_DPM_UserCableDetection(PortNum, State);
      DPM_Params[PortNum].ActiveCCIs = CCNONE;
      break;
    }
  default :
    /* nothing to do */
    break;
  }
}
#else
void USBPD_DPM_CADCallback(uint8_t PortNum, USBPD_CAD_EVENT State, CCxPin_TypeDef Cc)
{
#ifdef _TRACE
  USBPD_TRACE_Add(USBPD_TRACE_CADEVENT, PortNum, (uint8_t)State, NULL, 0);
#endif /* _TRACE */

  switch (State)
  {
    case USBPD_CAD_EVENT_ATTEMC :
    {
#ifndef _RTOS
      DPM_Sleep_time[PortNum] = 0;
#endif /* !_RTOS */
#ifdef _VCONN_SUPPORT
      DPM_Params[PortNum].VconnStatus = USBPD_TRUE;
#endif /* _VCONN_SUPPORT */
      DPM_ManageAttachedState(PortNum, State, Cc);
#ifdef _VCONN_SUPPORT
      DPM_CORE_DEBUG_TRACE(PortNum, "Note: VconnStatus=TRUE");
#endif /* _VCONN_SUPPORT */
      break;
    }
    case USBPD_CAD_EVENT_ATTACHED :
#ifndef _RTOS
      DPM_Sleep_time[PortNum] = 0;
#endif /* !_RTOS */
      DPM_ManageAttachedState(PortNum, State, Cc);
      break;
    case USBPD_CAD_EVENT_DETACHED :
    case USBPD_CAD_EVENT_EMC :
    {
      /* The ufp is detached */
      (void)USBPD_PE_IsCableConnected(PortNum, 0);
      /* Terminate PE task */
#ifdef _RTOS
      if (DPM_Thread_Table[PortNum] != NULL)
      {
#ifdef _LOW_POWER
        LPM_SetStopMode((LPM_Id_t)(LPM_PE_0 + PortNum), LPM_Enable);
        LPM_SetOffMode((LPM_Id_t)(LPM_PE_0 + PortNum), LPM_Enable);
#endif
        osThreadTerminate(DPM_Thread_Table[PortNum]);
        DPM_Thread_Table[PortNum] = NULL;
      }
#endif /* _RTOS */
      USBPD_DPM_UserCableDetection(PortNum, State);
      DPM_Params[PortNum].PE_SwapOngoing = USBPD_FALSE;
      DPM_Params[PortNum].ActiveCCIs = CCNONE;
      DPM_Params[PortNum].PE_Power   = USBPD_POWER_NO;
#ifdef _VCONN_SUPPORT
      DPM_Params[PortNum].VconnCCIs = CCNONE;
      DPM_Params[PortNum].VconnStatus = USBPD_FALSE;
      DPM_CORE_DEBUG_TRACE(PortNum, "Note: VconnStatus=FALSE");
#endif /* _VCONN_SUPPORT */
      break;
    }
    default :
      /* nothing to do */
      break;
  }
}

static void DPM_ManageAttachedState(uint8_t PortNum, USBPD_CAD_EVENT State, CCxPin_TypeDef Cc)
{
#ifdef _VCONN_SUPPORT
  if (CC1 == Cc)
  {
    DPM_Params[PortNum].VconnCCIs = CC2;
  }
  if (CC2 == Cc)
  {
    DPM_Params[PortNum].VconnCCIs = CC1;
  }
#endif /* _VCONN_SUPPORT */
  DPM_Params[PortNum].ActiveCCIs = Cc;
  (void)USBPD_PE_IsCableConnected(PortNum, 1);

  USBPD_DPM_UserCableDetection(PortNum, State);
#if defined(USBPD_TCPM_MODULE_ENABLED)
  /* Add a delay to postpone the 1st send of SRC capa
  FUS305 seems not react correctly if it sent too quickly */
  USBPD_DPM_WaitForTime(6);
#endif /* USBPD_TCPM_MODULE_ENABLED */

#ifdef _RTOS
  /* Create PE task */
  if (DPM_Thread_Table[PortNum] == NULL)
  {
#if (osCMSIS < 0x20000U)
    DPM_Thread_Table[PortNum] = osThreadCreate(OSTHREAD_PE(PortNum), (void *)((uint32_t)PortNum));
#else
    DPM_Thread_Table[PortNum] = osThreadNew(OSTHREAD_PE(PortNum), NULL, OSTHREAD_PE_ATTR(PortNum));
#endif /* osCMSIS < 0x20000U */
    if (DPM_Thread_Table[PortNum] == NULL)
    {
      /* should not occurr. May be an issue with FreeRTOS heap size too small */
      while (1);
    }
  }
#endif /* _RTOS */
}
#endif /* USBPDCORE_LIB_NO_PD */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
